[
    {
        "domain": "Statistical Mechanics",
        "titles": "Introduction to Statistical Mechanics",
        "detail": "Statistical Mechanics is the branch of physics that uses probability theory to study the behavior of systems of a large number of particles. It connects macroscopic thermodynamic properties with microscopic particle interactions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Classical Statistical Mechanics",
        "detail": "Classical Statistical Mechanics deals with systems of classical particles and describes their behavior using the principles of classical mechanics and statistics.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Quantum Statistical Mechanics",
        "detail": "Quantum Statistical Mechanics extends classical principles to systems where quantum effects are significant. It describes systems of particles following Fermi-Dirac or Bose-Einstein statistics.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "The Canonical Ensemble",
        "detail": "The Canonical Ensemble represents a system in thermal equilibrium with a heat reservoir at a fixed temperature. It is characterized by the partition function, which encodes the statistical properties of the system.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "The Grand Canonical Ensemble",
        "detail": "The Grand Canonical Ensemble is used to describe systems in contact with a heat and particle reservoir. It allows the exchange of energy and particles and is characterized by temperature, volume, and chemical potential.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Microcanonical Ensemble",
        "detail": "The Microcanonical Ensemble describes an isolated system with fixed energy, volume, and particle number. It is useful for studying systems with fixed energy and exploring entropy and thermodynamic quantities.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Phase Transitions and Critical Phenomena",
        "detail": "Phase Transitions and Critical Phenomena study changes between different states of matter, such as solid, liquid, and gas. Critical phenomena occur near phase transition points where physical properties show power-law behavior.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Ising Model 1D",
        "detail": "The Ising Model 1D is a mathematical model of ferromagnetism in statistical mechanics. It consists of discrete variables representing magnetic dipole moments of atomic spins, arranged in a linear chain.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Ising Model 2D",
        "detail": "The Ising Model 2D extends the 1D Ising model to two dimensions. It is used to study phase transitions, particularly in the context of magnetism, and exhibits a phase transition at finite temperature.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Ising Model 3D",
        "detail": "The Ising Model 3D further extends the Ising model to three dimensions. It is more complex and is used to study critical phenomena and phase transitions in three-dimensional systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The XY Model",
        "detail": "The XY Model is a statistical model of spins on a lattice where each spin can rotate freely in a plane. It is used to study phase transitions, particularly the Berezinskii-Kosterlitz-Thouless transition.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Heisenberg Model",
        "detail": "The Heisenberg Model describes interactions between neighboring spins in a crystal lattice. It is used to study magnetic properties and phase transitions in materials.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Potts Model",
        "detail": "The Potts Model generalizes the Ising model to more than two possible spin states. It is used to study phase transitions and critical phenomena in systems with multiple states.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The q-state Potts Model",
        "detail": "The q-state Potts Model extends the Potts model to q possible states for each spin. It is used to study a variety of phenomena in statistical mechanics, including magnetism and percolation.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Blume-Capel Model",
        "detail": "The Blume-Capel Model is a spin-1 Ising model that includes a single-ion anisotropy term. It is used to study tricritical points and phase transitions in magnetic systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Ashkin-Teller Model",
        "detail": "The Ashkin-Teller Model is a generalization of the Ising model that includes interactions between four spins. It is used to study complex phase transitions and critical behavior.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Clock Model",
        "detail": "The Clock Model is a variation of the Potts model where spins can take on discrete angles. It is used to study phase transitions and critical phenomena in systems with angular variables.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Percolation Model",
        "detail": "The Percolation Model studies the movement and connectivity of particles on a lattice. It is used to study phenomena like fluid flow in porous media and network robustness.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Spin Glasses",
        "detail": "Spin Glasses are disordered magnetic systems with competing interactions. They are used to study complex energy landscapes and slow dynamics in disordered systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Lattice Gas Models",
        "detail": "Lattice Gas Models describe particles distributed on a lattice with nearest-neighbor interactions. They are used to study fluid dynamics and phase transitions in fluids.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Cellular Automata Models",
        "detail": "Cellular Automata Models consist of a grid of cells that evolve according to simple rules. They are used to study complex systems and emergent behavior from simple interactions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Hard Sphere Models",
        "detail": "Hard Sphere Models describe particles as hard spheres that cannot overlap. They are used to study phase transitions and thermodynamic properties of dense fluids and solids.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Soft Sphere Models",
        "detail": "Soft Sphere Models describe particles that interact with soft, repulsive potentials. They are used to study the behavior of colloids, polymers, and other soft matter systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Lennard-Jones Potential Models",
        "detail": "Lennard-Jones Potential Models describe particles interacting through the Lennard-Jones potential. They are used to study molecular dynamics, phase transitions, and properties of liquids and gases.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Ideal Gas Model",
        "detail": "The Ideal Gas Model describes a gas of non-interacting particles. It is used to study thermodynamic properties and provides a simple approximation for real gases.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Van der Waals Gas Model",
        "detail": "The Van der Waals Gas Model improves upon the ideal gas model by including interactions between particles. It is used to study real gases and phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "Real Gas Models",
        "detail": "Real Gas Models describe gases with complex interactions between particles. They are used to study deviations from ideal behavior and properties of real gases.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Bose-Einstein Condensate",
        "detail": "The Bose-Einstein Condensate is a state of matter formed by bosons cooled to near absolute zero. It is used to study quantum phenomena on a macroscopic scale.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Fermion System",
        "detail": "The Fermion System describes particles that obey Fermi-Dirac statistics. It is used to study properties of systems like electrons in metals and nucleons in atomic nuclei.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Boson System",
        "detail": "The Boson System describes particles that obey Bose-Einstein statistics. It is used to study properties of systems like photons, phonons, and superfluid helium.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics Models",
        "titles": "The Many-body System",
        "detail": "The Many-body System studies interactions between a large number of particles. It is used to understand collective behavior and emergent properties in complex systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Quantum Monte Carlo Methods",
        "detail": "Quantum Monte Carlo Methods are computational techniques used to study quantum systems. They are used to calculate properties of quantum systems with high accuracy.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Classical Monte Carlo Methods",
        "detail": "Classical Monte Carlo Methods are computational techniques used to study classical systems. They are used to simulate thermodynamic properties and phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Path Integral Monte Carlo",
        "detail": "Path Integral Monte Carlo is a quantum Monte Carlo method that uses Feynman's path integral formulation. It is used to study quantum systems at finite temperatures.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Replica Monte Carlo",
        "detail": "Replica Monte Carlo is a method used to study disordered systems like spin glasses. It uses multiple replicas of the system to sample the energy landscape.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Cluster Algorithms",
        "detail": "Cluster Algorithms are Monte Carlo methods that group spins into clusters to improve efficiency. They are used to study phase transitions and critical phenomena.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Metropolis-Hastings Algorithm",
        "detail": "The Metropolis-Hastings Algorithm is a Markov Chain Monte Carlo method used to sample from probability distributions. It is widely used in statistical physics and Bayesian statistics.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Heat Bath Algorithm",
        "detail": "The Heat Bath Algorithm is a Monte Carlo method that simulates thermal baths. It is used to sample spin configurations in models like the Ising and Potts models.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Wang-Landau Algorithm",
        "detail": "The Wang-Landau Algorithm is a Monte Carlo method that calculates the density of states. It is used to study systems with complex energy landscapes and phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Multicanonical Ensemble",
        "detail": "The Multicanonical Ensemble is a Monte Carlo method that samples from a flat energy distribution. It is used to study phase transitions and systems with rare events.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Quantum Spin Models",
        "detail": "Quantum Spin Models describe interactions between quantum spins in a lattice. They are used to study magnetic properties and quantum phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Hubbard Model",
        "detail": "The Hubbard Model describes electrons in a lattice with on-site interactions. It is used to study strongly correlated electron systems and high-temperature superconductivity.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "t-J Model",
        "detail": "The t-J Model is a variation of the Hubbard model that includes exchange interactions. It is used to study high-temperature superconductivity and strongly correlated systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "The Anderson Model",
        "detail": "The Anderson Model describes localized electron states in a disordered lattice. It is used to study localization and transport properties in disordered systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Density Functional Theory",
        "detail": "Density Functional Theory is a computational method used to study the electronic structure of matter. It is widely used in condensed matter physics, chemistry, and materials science.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Quantum Lattice Models",
        "detail": "Quantum Lattice Models describe particles on a lattice with quantum mechanical interactions. They are used to study properties of materials and phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Lattice Gauge Theory",
        "detail": "Lattice Gauge Theory is a computational method used to study gauge theories on a lattice. It is used to study quantum chromodynamics and other field theories.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Molecular Dynamics Simulations",
        "detail": "Molecular Dynamics Simulations are computational methods used to study the motion of particles. They are used to study properties of liquids, solids, and biological systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Langevin Dynamics",
        "detail": "Langevin Dynamics is a method used to simulate the motion of particles with friction and random forces. It is used to study systems with thermal noise and dissipative dynamics.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Brownian Motion",
        "detail": "Brownian Motion describes the random motion of particles in a fluid. It is used to study diffusion, transport properties, and thermal fluctuations in condensed matter systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Non-equilibrium Statistical Mechanics",
        "detail": "Non-equilibrium Statistical Mechanics studies systems that are not in thermal equilibrium. It is used to study transport properties, reaction kinetics, and systems with external driving forces.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Renormalization Group Theory",
        "detail": "Renormalization Group Theory is a mathematical framework used to study changes in a physical system as it is viewed at different length scales. It is used to study critical phenomena and phase transitions.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Mean Field Theory",
        "detail": "Mean Field Theory is an approximation method used to study phase transitions and critical phenomena. It assumes that each particle in a system feels an average field due to all other particles.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Finite Size Scaling",
        "detail": "Finite Size Scaling is a method used to study the behavior of systems near critical points by analyzing the effects of finite system size. It is used to extract critical exponents and phase transition properties.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Quantum Phase Transitions",
        "detail": "Quantum Phase Transitions are transitions between different quantum states of matter at zero temperature. They are driven by quantum fluctuations and are studied using models like the quantum Ising model.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Topological Phases of Matter",
        "detail": "Topological Phases of Matter are states of matter characterized by topological properties rather than local order parameters. They are studied using models like the Kitaev model and are important in understanding quantum computing.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Frustrated Systems",
        "detail": "Frustrated Systems are systems in which competing interactions prevent the system from reaching a simple ground state. They are studied using models like the spin ice and kagome lattice.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Quantum Magnetism",
        "detail": "Quantum Magnetism studies the magnetic properties of quantum systems. It is used to understand phenomena like magnetic ordering, spin waves, and quantum critical points.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "High-temperature Superconductors",
        "detail": "High-temperature Superconductors are materials that exhibit superconductivity at relatively high temperatures. They are studied using models like the Hubbard and t-J models to understand their mechanisms.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Quantum Hall Effect",
        "detail": "The Quantum Hall Effect is a quantum phenomenon observed in 2D electron systems under strong magnetic fields. It is characterized by quantized Hall conductance and is studied using models like the Landau levels.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Anderson Localization",
        "detail": "Anderson Localization is the absence of diffusion of waves in a disordered medium. It is studied using models like the Anderson model and is important in understanding electronic properties of disordered systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Quantum Monte Carlo in Condensed Matter",
        "detail": "Quantum Monte Carlo in Condensed Matter uses Monte Carlo techniques to study quantum systems in condensed matter physics. It is used to calculate properties of systems like the Hubbard model and spin systems.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Quantum Dots and Wires",
        "detail": "Quantum Dots and Wires are low-dimensional semiconductor structures that exhibit quantum confinement effects. They are studied using models like the effective mass approximation and are important in nanotechnology.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Condensed Matter Physics",
        "titles": "Spintronics",
        "detail": "Spintronics studies the spin of electrons in solid-state systems and its applications in electronic devices. It is used to develop technologies like spin transistors and magnetic memory.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Statistical Mechanics",
        "titles": "Nonequilibrium Green’s Functions",
        "detail": "Nonequilibrium Green’s Functions are used to study transport properties and nonequilibrium phenomena in quantum systems. They are used to analyze systems driven out of equilibrium by external fields.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Monte Carlo Methods for Lattice Field Theory",
        "detail": "Monte Carlo Methods for Lattice Field Theory are computational techniques used to study quantum field theories on a lattice. They are used to calculate properties of systems like quantum chromodynamics.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Quantum Monte Carlo for Bosonic Systems",
        "detail": "Quantum Monte Carlo for Bosonic Systems uses Monte Carlo techniques to study systems of bosons. It is used to calculate properties of systems like superfluid helium and Bose-Einstein condensates.",
        "subject": "Computational Physics"
    },
    {
        "domain": "Monte Carlo Methods",
        "titles": "Quantum Monte Carlo for Fermionic Systems",
        "detail": "Quantum Monte Carlo for Fermionic Systems uses Monte Carlo techniques to study systems of fermions. It is used to calculate properties of systems like electrons in metals and nucleons in atomic nuclei.",
        "subject": "Computational Physics"
    }
]
